Repository: 84000/data-translation-memory
Catalog: Toh_244-Proper_Dharma_Conduct-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཆོས་ཀྱི་ཚུལ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra Proper Dharma Conduct

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་ན་སྨྱུག་མ་ལས་བྱས་པའི་འཁོར་གྱི་ཁྱམས་ན་བཞུགས་ཏེ།
en: The Blessed One was at Prince Jeta’s Grove at Śrāvastī, where he was residing in a pavilion made of bamboo.

source: དེའི་ཚེ་སྨྱུག་མ་ལས་བྱས་པའི་འཁོར་གྱི་ཁྱམས་སུ་འདུས་ཤིང་འཁོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་མང་པོ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: At that time, a great number of bodhisattvas, who were also gathered and assembled at the bamboo pavilion, had the following thought:

source: བདག་ཅག་གིས་ཇི་ལྟར་གནས་པར་བྱ།
en: “How are we to live?

source: ཇི་ལྟར་བསྒྲུབ་པར་བྱ།
en: How are we to practice?

source: ཇི་ལྟར་རྣལ་འབྱོར་དུ་བྱ།
en: How are we to train?

source: ཇི་ལྟར་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་སྙམ་པ་དང་། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་མང་པོ་དེ་དག་གི་བསམ་པ་མཁྱེན་ནས་
en: How are we to ripen others?” Knowing the thoughts of these many bodhisattvas, the Blessed One

source: སྨྱུག་མ་ལས་བྱས་པའི་འཁོར་གྱི་ཁྱམས་ག་ལ་བ་དེར་གཤེགས་ཏེ་བྱོན་ནས་གདན་བཏིང་བ་ལ་བཞུགས་སོ། །
en: went before them and sat down on a seat by the pavilion in front of them.

source: བཞུགས་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རབ་ཏུ་མང་པོ་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Sitting there, the Blessed One said to the many bodhisattvas,

source: རིགས་ཀྱི་བུ་དག་ལེགས་སོ་ལེགས་སོ། །
en: “Noble sons, excellent, excellent.

source: ཁྱོད་ཀྱི་རྟོག་པ་ནི་བཟང་ངོ་། །
en: Your intention is noble,

source: ཡིད་ཀྱི་དྲི་བ་ནི་མཛེས་སོ། །
en: your questions are beautiful,

source: སྤོབས་པ་ནི་དགེའོ། །
en: your eloquence is virtuous, and

source: ཡིད་ལ་བྱ་བ་ནི་ཚུལ་བཞིན་ནོ། །
en: your concerns are proper.

source: རིགས་ཀྱི་བུ་དག་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: Therefore, noble sons, listen carefully and keep in mind what is said.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཚུལ་གང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་སྟོན་པར་བྱེད་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་རྗོད་པར་བྱེད་པ་དེ་ལྟ་བུའི་ཆོས་ཀྱི་ཚུལ་ངས་ཁྱོད་ལ་བཤད་དོ། །
en: I shall now explain proper Dharma conduct to you. This includes a presentation of the complete bodhisattva conduct—the proper conduct of bodhisattva great beings—and an explanation of all buddha qualities.”

source: བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: “Very well, Blessed One,” the bodhisattvas replied, and they listened to the Blessed One with full attention. The Blessed One said,

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་མྱ་ངན་ལས་འདས་པའི་བསམ་པ་ཅན་དུ་གྱིས་ཤིག །
en: “Noble sons, maintain the thought of nirvāṇa and

source: འཁོར་བར་སྦྱོར་བ་ཅན་དུ་གྱིས་ཤིག །
en: apply yourselves to saṃsāra.

source: འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་ལ་ཡང་གནས་པར་མ་བྱེད་ཅིག །
en: Do not dwell in either saṃsāra or in nirvāṇa.”

source: དེ་དག་གིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་མྱ་ངན་ལས་འདས་པའི་བསམ་པ་ཅན་དང་འཁོར་བར་སྦྱོར་བ་ཅན་ལགས།
en: The bodhisattvas asked, “Blessed One, how do bodhisattvas maintain the thought of nirvāṇa and apply themselves to saṃsāra?

source: ཇི་ལྟར་ན་འཁོར་བ་དང་། མྱ་ངན་ལས་འདས་པ་ལ་ཡང་མི་གནས་པ་ལགས།
en: How do they not dwell in either saṃsāra or in nirvāṇa?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One said,

source: འཆི་བ་མེད་པའི་བདེ་བ་ལ་རེག་པར་བྱ་བའི་ཕྱིར་མྱ་ངན་ལས་འདས་པའི་བསམ་པ་ཅན་ཡིན།
en: “They maintain the thought of nirvāṇa in order to reach the happiness of immortality.

source: དགེ་བའི་རྩ་བ་བསགས་པའི་ཕྱིར་འཁོར་བར་སྦྱོར་བ་ཅན་ཡིན།
en: They apply themselves to saṃsāra in order to gather the roots of virtue.

source: འཕགས་པ་དང་སོ་སོའི་སྐྱེ་བོ་དག་སྟེན་པའི་ཕྱིར་འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པ་ལའང་མི་གནས་ཏེ་དེ་ནི་ཚུལ་ལོ། །
en: They do not dwell in either saṃsāra or nirvāṇa in order to attend to noble and ordinary beings. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་རང་གི་སེམས་ཡོངས་སུ་སྦྱོངས་ཤིག །
en: “Therefore, noble sons, train your minds,

source: ཕ་རོལ་གྱི་སེམས་སྲུངས་ཤིག །
en: protect the minds of others, and

source: སེམས་དཔའ་བ་ཅན་དུ་གྱིས་ཤིག །
en: be courageous.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་རང་གི་སེམས་ཡོངས་སུ་སྦྱོང་བར་བགྱིད་པ་ལགས།
en: The bodhisattvas asked, “Blessed One, how do bodhisattvas train their minds?

source: ཇི་ལྟར་ན་གཞན་གྱི་སེམས་སྲུང་བ་ལགས།
en: How do they protect the minds of others?

source: ཇི་ལྟར་ན་སེམས་དཔའ་བ་ཅན་ལགས།
en: How are they courageous?”

source: བཀའ་སྩལ་པ། ཉོན་མོངས་པ་སེལ་བས་རང་གི་སེམས་ཡོངས་སུ་སྦྱོང་བར་བྱེད་པ་ཡིན།
en: The Blessed One said, “They train their minds by eliminating afflictions.

source: ཁོང་ཁྲོ་བ་མེད་པས་གཞན་གྱི་སེམས་སྲུང་བ་ཡིན།
en: They protect others’ minds by being without anger.

source: བྱང་ཆུབ་ཀྱི་སེམས་མི་གཏོང་བས་སེམས་དཔའ་བ་ཡིན་ཏེ་དེ་ནི་ཚུལ་ལོ། །
en: They are courageous as they do not relinquish the mind of awakening. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་བྱ་བ་དང་ཡང་འགལ་བར་མ་བྱེད་ཅིག །
en: “Therefore, noble sons, do not go against what is proper,

source: བྱ་བ་མ་ཡིན་པ་ལ་ཡང་སྣང་བར་གྱིས་ཤིག །
en: perceive what is improper, and

source: བྱས་པ་ལ་ལན་རེ་བ་མེད་པར་གྱིས་ཤིག །
en: do not hope to get anything in return for what has been done.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བགྱི་བ་དང་མི་འགལ་བར་བགྱིད་པ་ལགས།
en: The bodhisattvas asked, “Blessed One, how do bodhisattvas not go against what is proper?

source: ཇི་ལྟར་ན་མི་བགྱི་བ་ལ་ཡང་གདའ་བ་ལགས།
en: How do they leave behind what is improper?

source: ཇི་ལྟར་ན་བགྱི་བ་ལ་ལན་རེ་བ་མ་མཆིས་པ་ལགས།
en: How do they not hope to get anything in return for what has been done?”

source: བཀའ་སྩལ་པ། བྱ་བ་དང་འགལ་བར་མི་བྱ་བ་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཆོས་ལ་འཇུག་པས་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལ་ཡིད་ཆེས་པར་བྱའོ། །
en: The Blessed One said, “ ‘Not going against what is proper’ means having confidence in the ripening of actions due to engaging with the Dharma of dependent origination.

source: བྱ་བ་མ་ཡིན་པ་ལ་སྣང་བ་ནི་སྙིང་རྗེ་ཆེན་པོ་ལ་འཇུག་པའོ། །
en: ‘Perceiving what is improper’ means being committed to great compassion.

source: བྱས་པ་ལ་ལན་རེ་བ་མེད་པ་ནི་ལན་དུ་ཕན་འདོགས་པར་རེ་བ་མེད་པ་སྟེ་དེ་ནི་ཚུལ་ལོ། །
en: ‘Not hoping to get anything in return for what has been done’ means not hoping for any benefit in return. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་དུས་མ་ཡིན་པར་ནི་མ་ལྡང་ཅིག །
en: “Therefore, noble sons, do not get up at inappropriate times.

source: དུས་ལ་བབ་ན་ནི་མ་ཉལ་ཅིག །
en: Do not sleep when the time has come.

source: ཉལ་བ་རྣམས་ནི་སློང་ཤིག །
en: Rouse those who are sleeping.

source: རྟག་ཏུ་ནི་ཉོལ་ཅིག །
en: Sleep forever.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དུས་མ་ལགས་པར་མི་ལྡང་བ་ལགས།
en: The bodhisattvas asked, “Blessed One, how do bodhisattvas not get up at inappropriate times?

source: ཇི་ལྟར་ན་དུས་ལ་བབ་ན་མི་ཉལ་བ་ལགས།
en: How do they not sleep when the time has come?

source: ཇི་ལྟར་ན་ཉལ་བ་རྣམས་སློང་བ་ལགས།
en: How do they rouse those who are sleeping?

source: ཇི་ལྟར་ན་རྟག་ཏུ་ཉལ་བ་ལགས།
en: How do they sleep forever?”

source: བཀའ་སྩལ་པ། དུས་མ་ཡིན་པར་མི་ལྡང་བ་ནི་སྣོད་དུ་མ་གྱུར་པ་རྣམས་ལ་ཆོས་མི་བསྟན་པའོ། །
en: The Blessed One said, “ ‘Not getting up at inappropriate times’ means not teaching the Dharma to those who are inappropriate recipients.

source: དུས་ལ་བབ་ན་མི་ཉལ་བ་ནི་སྣོད་དུ་གྱུར་པ་ལས་འདའ་བར་མི་བྱའོ། །
en: ‘Not sleeping when the time has come’ means not passing over suitable vessels.

source: ཉལ་བ་རྣམས་བསླང་བ་ནི་དུས་དང་དུས་མ་ཡིན་པས་བསྐུལ་བའོ། །
en: ‘Rousing those who sleep’ means encouraging others in terms of the appropriate and inappropriate times.

source: རྟག་ཏུ་ཉལ་བ་ནི་སྙོམས་པར་འཇུག་པ་ལས་མི་ལྡང་བ་སྟེ་དེ་ནི་ཚུལ་ལོ། །
en: ‘Sleeping forever’ means never arising from attainment. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་ཡིད་བརྟན་པ་མེད་པར་གྱིས་ཤིག །
en: “Therefore, noble sons, be without confidence,

source: ཡིད་བརྟན་པ་གཞིག་པར་གྱིས་ཤིག །
en: destroy confidence, and

source: ཡིད་མ་བརྟན་པ་རྣམས་ལ་ཡིད་བརྟན་པར་གྱིས་ཤིག །
en: have confidence in those without confidence.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡིད་མི་རྟོན་པ་ལགས།
en: The bodhisattvas asked, “Blessed One, how are bodhisattvas without confidence?

source: ཇི་ལྟར་ན་ཡིད་བརྟན་པ་འཇིག་པར་བགྱིད་པ་ལགས།
en: How do they destroy confidence?

source: ཇི་ལྟར་ན་ཡིད་མ་བརྟན་པ་རྣམས་ལ་ཡིད་རྟོན་པ་ལགས།
en: How do they have confidence in those without confidence?”

source: བཀའ་སྩལ་པ། ཡིད་མི་བརྟན་ཞེས་བྱ་བ་ནི་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་ཡིད་མི་གཞག་པའོ། །
en: The Blessed One said, “ ‘Being without confidence’ means not settling the mind in the formless attainments.

source: ཡིད་བརྟན་པ་གཞིག་པར་བྱ་བ་ནི་སྙོམས་པར་འཇུག་པ་བཟློག་པའོ། །
en: ‘Destroying confidence’ means reversing the formless attainments.

source: ཡིད་མ་བརྟན་པ་རྣམས་ལ་ཡིད་བརྟན་པར་བྱ་བ་ནི་ལོག་པར་ཞུགས་པ་རྣམས་ལ་སྟེ་དེ་ནི་ཚུལ་ལོ། །
en: ‘Having confidence in those without confidence’ refers to those who are in error. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་ནོར་དང་ལྡན་པར་གྱིས་ཤིག །
en: “Therefore, noble sons, be endowed with wealth.

source: བྱས་པ་ཤེས་པ་མེད་པར་སྦྱོར་ཅིག །
en: Connect those who are without gratitude.

source: ཅི་ལའང་ལན་རེ་བར་མ་བྱེད་ཅིག །
en: Do not hope to get anything in return.

source: རྙེད་པ་ཆེན་པོས་ཉེ་བར་འཚོ་བར་གྱིས་ཤིག །
en: Maintain a livelihood with great profit.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནོར་དང་ལྡན་པ་ལགས།
en: The bodhisattvas asked, “Blessed One, how are bodhisattvas endowed with wealth?

source: ཇི་ལྟར་ན་བྱས་པ་འཚལ་བ་མ་མཆིས་པར་སྦྱོར་བ་ལགས།
en: How do they connect those who are without gratitude?

source: ཇི་ལྟར་ན་ཅི་ལའང་ལན་མི་རེ་བ་ལགས།
en: How do they not hope to get anything in return?

source: ཇི་ལྟར་ན་རྙེད་པ་ཆེན་པོས་ཉེ་བར་འཚོ་བ་ལགས།
en: How do they maintain a livelihood with great profit?”

source: བཀའ་སྩལ་པ། ནོར་དང་ལྡན་པ་ཞེས་བྱ་བ་ནི་ནོར་བདུན་དང་ལྡན་པའོ། །
en: The Blessed One said, “ ‘Being endowed with wealth’ means being endowed with the seven riches.

source: བྱས་པ་ཤེས་པ་མེད་པར་སྦྱར་བ་ནི་སེར་སྣ་ཅན་རྣམས་སྦྱིན་པ་ལ་སྦྱར་བ་དང་། ཤེས་རབ་འཆལ་པ་རྣམས་ཤེས་རབ་ལ་སྦྱར་བའོ། །
en: ‘Connecting those who are without gratitude’ means connecting the greedy with generosity and connecting those with distorted wisdom with wisdom.

source: ཅི་ལའང་ལན་རེ་བ་མེད་པ་ནི་རང་གི་དགོས་པ་ལའང་ནན་ཏན་དུ་བྱ་བའོ། །
en: ‘Not hoping to get anything in return’ means diligently working toward one’s own purpose.

source: རྙེད་པ་ཆེན་པོས་ཉེ་བར་འཚོ་བ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་སྟེ་དེ་ནི་ཚུལ་ལོ། །
en: ‘Maintaining a livelihood with great profit’ means dedicating toward unsurpassed and perfect awakening. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་ཆགས་པ་ཡང་ཤེས་པར་གྱིས་ཤིག །
en: “Therefore, noble sons, understand passion.

source: ཆགས་པ་རྣམས་ལ་ཡང་སྤྱོད་ཅིག །
en: Enjoy passion.

source: ཆགས་པ་ལ་ཞེན་པ་རྣམས་ལའང་ལྟོས་ཤིག །
en: Consider those who are attached to passion.

source: ཆགས་པ་མེད་པ་ལའང་སྲུངས་ཤིག །
en: Protect those who are without passion.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཆགས་པ་འཚལ་བ་ལགས།
en: The bodhisattvas asked, “Blessed One, how do bodhisattvas understand passion?

source: ཇི་ལྟར་ན་ཆགས་པ་རྣམས་ལ་སྤྱོད་པ་ལགས།
en: How do they enjoy passion?

source: ཇི་ལྟར་ན་ཆགས་པར་ཞེན་པ་ལ་ལྟ་བ་ལགས།
en: How do they consider those who are attached to passion?

source: ཇི་ལྟར་ན་ཆགས་པ་མ་མཆིས་པ་སྲུང་བ་ལགས།
en: How do they protect those who are without passion?”

source: བཀའ་སྩལ་པ། ཆགས་པ་ཤེས་པར་བྱ་བ་ནི་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སོ། །
en: The Blessed One said, “ ‘Understanding passion’ means understanding the formless attainments.

source: ཆགས་པ་རྣམས་ལ་སྤྱད་པ་ནི་སྐྱེ་མཆེད་དྲུག་གཅད་པའོ། །
en: ‘Enjoying passion’ means cutting the six sense sources.

source: ཆགས་པར་ཞེན་པ་ལ་ལྟ་བ་ནི་སོ་སོའི་སྐྱེ་བོ་ཡོངས་སུ་སྨིན་པར་བྱ་བའོ། །
en: ‘Considering those who are attached to passion’ means ripening ordinary beings.

source: ཆགས་པ་མེད་པ་སྲུང་བ་ནི་སྐྱོན་མེད་པར་མི་འཇུག་པ་སྟེ་དེ་ནི་ཚུལ་ལོ། །
en: ‘Protecting those who are without passion’ means not entering the state that is free from faults. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་འཇིགས་པར་གྱིས་ཤིག །
en: “Therefore, noble sons, be terrified,

source: མངོན་པར་དགའ་བ་མེད་པར་གྱིས་ཤིག །
en: be without joy,

source: སྙིང་བརྩེ་བ་མེད་པར་གྱིས་ཤིག །
en: be without love, and

source: སྙིང་རྗེ་བ་མེད་པར་གྱིས་ཤིག །
en: be without compassion.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འཇིགས་པར་བགྱིད་པ་ལགས།
en: The bodhisattvas asked, “Blessed One, how are bodhisattvas terrified?

source: ཇི་ལྟར་ན་མངོན་པར་དགའ་བ་མ་མཆིས་པ་ལགས།
en: How are they without joy?

source: ཇི་ལྟར་ན་སྙིང་བརྩེ་བ་མ་མཆིས་པ་ལགས།
en: How are they without love?

source: ཇི་ལྟར་ན་སྙིང་རྗེ་བ་མ་མཆིས་པ་ལགས།
en: How are they not compassionate?”

source: བཀའ་སྩལ་པ། འཇིགས་ཞེས་བྱ་བ་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སས་འཇིགས་པའོ། །
en: The Blessed One said, “ ‘Terrified’ means being terrified by the levels of the hearers and the solitary buddhas.

source: མངོན་པར་དགའ་བ་མེད་ཅེས་བྱ་བ་ནི་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་དགའ་བ་མེད་པའོ། །
en: ‘Without joy’ means not finding any joy in the formless attainments.

source: སྙིང་བརྩེ་བ་མེད་པ་ནི་ཕྱི་རོལ་གྱི་དངོས་པོ་རྣམས་ཡོངས་སུ་བཏང་བ་ལའོ། །
en: ‘Without love’ means relinquishing outer phenomena.

source: སྙིང་རྗེ་བ་མེད་པ་ནི་ནང་གི་དངོས་པོ་མགོ་ལ་སོགས་པ་ཡོངས་སུ་བཏང་བ་ལ་སྟེ། དེ་ནི་ཚུལ་ལོ། །
en: ‘Without compassion’ means giving away personal body parts, such as the head. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་བདེན་པ་ཡང་ཁོང་དུ་ཆུད་པར་གྱིས་ཤིག ། བརྫུན་དུ་སྨྲ་བ་ཡང་མ་སྤང་ཞིག །
en: “Therefore, noble sons, understand the truth and do not give up lying.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བདེན་པ་ཁོང་དུ་ཆུད་པར་བགྱི་བ་ལགས།
en: The bodhisattvas asked, “Blessed One, how do bodhisattvas understand the truth?

source: ཇི་ལྟར་ན་བརྫུན་དུ་སྨྲ་བ་ནི་མི་སྤོང་བ་ལགས།
en: How do they not give up lying?”

source: བཀའ་སྩལ་པ། བདེན་པ་ཁོང་དུ་ཆུད་པར་བྱ་བ་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་འདུལ་བའི་ཕྱིར་རོ། །
en: The Blessed One said, “They ‘understand the truth’ in order to tame hearers and solitary buddhas.

source: བརྫུན་དུ་སྨྲ་བ་མི་སྤང་བ་ནི་འདུས་བྱས་ལ་ཉེ་བར་སྤྱོད་པའི་ཕྱིར་ཏེ་དེ་ནི་ཚུལ་ལོ། །
en: They ‘do not give up lying’ in order to make use of conditioned phenomena. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་ཕ་རོལ་ཏུ་ཕྱིན་པར་བགྱིས་ཏེ། ཚུ་རོལ་གྱི་ངོགས་ལ་བལྟ་བར་གྱིས་ཤིག །
en: “Therefore, noble sons, cross over but look at the shore on this side.

source: ཕ་རོལ་ཏུ་ཕྱིན་པར་མ་བྱེད་པར་ཕ་རོལ་གྱི་ངོགས་ལ་བལྟ་བར་གྱིས་ཤིག །
en: Look at the shore on the other side but do not cross over.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཕ་རོལ་ཏུ་ཕྱིན་ཅིང་ཚུ་རོལ་གྱི་ངོགས་ལ་བལྟ་བ་ལགས།
en: The bodhisattvas asked, “Blessed One, how do bodhisattvas cross over but look at the shore on this side?

source: ཇི་ལྟར་ན་ཕ་རོལ་ཏུ་ཕྱིན་པར་མི་བགྱིད་ཅིང་ཕ་རོལ་གྱི་ངོགས་ལ་བལྟ་བ་ལགས།
en: How do they look at the shore on the other side without crossing over?”

source: བཀའ་སྩལ་པ། ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་། སྤྱོད་པ་དང་། བསམ་པ་ལའོ། །
en: The Blessed One said, “ ‘Crossing over’ refers to the minds, conduct, and thoughts of all beings.

source: ཚུ་རོལ་གྱི་ངོགས་ལ་བལྟ་བ་ནི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་རོ། །
en: They ‘look at the shore on this side’ in order to ripen all beings.

source: ཕ་རོལ་ཏུ་ཕྱིན་པར་མི་བྱ་བ་ནི་ཕ་རོལ་བསྒྲལ་བའི་ཕྱིར་རོ། །
en: They ‘do not cross over’ so that they can liberate others.

source: ཕ་རོལ་གྱི་ངོགས་ལ་ལྟ་བ་ནི་རྟག་ཏུ་མྱ་ངན་ལས་འདའ་བ་ལ་གཞོལ་བར་བྱ་སྟེ་དེ་ནི་ཚུལ་ལོ། །
en: ‘Looking at the shore on the other side’ means always leaning toward nirvāṇa. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་རྟག་ཏུ་མི་འཐུན་པར་ཡང་གྱིས་ལ་རྩོད་པ་མེད་པ་མཆོག་ཏུ་ཡང་གྱིས་ཤིག །
en: “Therefore, noble sons, on the one hand never conform, and on the other hand do take the lack of dispute to be supreme.

source: བྱམས་པ་ལ་ཡང་གནས་ལ་སྐྱོན་ཡང་མཐོང་བར་གྱིས་ཤིག །
en: On the one hand dwell in love, and on the other hand do see flaws.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་རྟག་ཏུ་མི་འཐུན་པར་བགྱིད་པ་དང་། རྩོད་པ་མ་མཆིས་པ་མཆོག་ཏུ་བགྱིད་པ་ལགས།
en: The bodhisattvas asked, “Blessed One, how do bodhisattvas never conform and take the lack of dispute to be supreme?

source: ཇི་ལྟར་ན་བྱམས་པ་ལ་གནས་ཤིང་སྐྱོན་ཡང་མཐོང་བ་ལགས།
en: How do they dwell in love but also see flaws?”

source: བཀའ་སྩལ་པ། རྟག་ཏུ་མི་འཐུན་པར་བྱེད་པ་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་ཕྱིར་རོ། །
en: The Blessed One said, “They ‘never conform’ in order to uphold the sacred Dharma.

source: རྩོད་པ་མེད་པ་མཆོག་ཏུ་བྱེད་པ་ནི་བསམ་པ་དག་པའི་ཕྱིར་རོ། །
en: They ‘take the lack of dispute to be supreme’ in order to purify thoughts.

source: བྱམས་པ་ལ་གནས་པ་ནི་སེམས་ཅན་ཡོངས་སུ་བསྐྱབ་པའི་ཕྱིར་རོ། །
en: They ‘dwell in love’ in order to protect beings.

source: ཉེས་པ་མཐོང་བ་ནི་འདུས་བྱས་ཀྱི་དངོས་པོ་ཐམས་ཅད་དེ་དེ་ནི་ཚུལ་ལོ། །
en: ‘Seeing flaws’ means seeing all compounded entities.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་ཟད་པ་ཡང་ཟད་པར་མ་བྱེད་ཅིག །མི་ཟད་པར་ཡང་ལྟུང་བར་མ་བྱེད་ཅིག །
en: “Therefore, noble sons, on the one hand do not exhaust what becomes exhausted, and on the other hand do not fall into what does not become exhausted.

source: ཟད་པའི་ཆོས་ཉིད་ཀྱང་ཁོང་དུ་ཆུད་པར་གྱིས་ཤིག །
en: Understand the nature of exhaustion.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཟད་པ་ཟད་པར་མི་བགྱིད་པ་ལགས།
en: The bodhisattvas asked, “Blessed One, how do bodhisattvas not exhaust what becomes exhausted?

source: ཇི་ལྟར་ན་མི་ཟད་པར་མི་ལྟུང་བ་ལགས།
en: How do they not fall into what does not become exhausted?

source: ཇི་ལྟར་ན་ཟད་པའི་ཆོས་ཉིད་ཀྱང་ཁོང་དུ་ཆུད་པ་ལགས།
en: How do they understand the nature of exhaustion?”

source: བཀའ་སྩལ་པ། ཟད་པ་ཞེས་བྱ་བ་ནི་འདུས་བྱས་སོ། །
en: The Blessed One said, “ ‘What becomes exhausted’ means the compounded.

source: མི་ཟད་པ་ཞེས་བྱ་བ་ནི་འདུས་མ་བྱས་སོ། །
en: ‘What does not become exhausted’ means the uncompounded.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔས་དགེ་བའི་རྩ་བ་བསགས་པའི་ཕྱིར་འདུས་བྱས་ཀྱང་ཟད་པར་མི་བྱའོ། །
en: In order to accumulate roots of virtue bodhisattvas must not exhaust compounded phenomena.

source: ཐབས་ལ་མཁས་པས་འདུས་མ་བྱས་སུ་ཡང་ལྟུང་བར་མི་བྱའོ། །
en: Using their skill in means, they must not fall into the uncompounded.

source: ཟད་པའི་ཆོས་ཉིད་ཁོང་དུ་ཆུད་པར་བྱ་བ་ནི་མི་རྟག་པའི་མཐར་འགྱུར་བ་སྟེ་དེ་ནི་ཚུལ་ལོ། །
en: ‘Understanding the nature of exhaustion’ means knowing the fact of impermanence. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་མུན་པའི་ནང་ནའང་གནས་པར་གྱིས་ཤིག །སྣང་བ་ཡང་ཟིན་པར་གྱིས་ཤིག །
en: “Therefore, noble sons, on the one hand dwell within darkness, and on the other hand seize the light.

source: མི་བྱ་བ་ནི་གྱིས་ཤིག །
en: Do what should not be done.

source: བྱ་བ་ནི་ཡལ་བར་ཞོག་ཤིག །
en: Set aside what should be done.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་མུན་པའི་ནང་ན་གནས་པ་ལགས།
en: The bodhisattvas asked, “Blessed One, how do bodhisattvas dwell within darkness?

source: ཇི་ལྟར་ན་སྣང་བ་ཟིན་པ་ལགས།
en: How do they seize the light?

source: ཇི་ལྟར་ན་མི་བགྱི་བ་བགྱིད་པ་ལགས།
en: How do they do what should not be done?

source: ཇི་ལྟར་ན་བགྱི་བ་ཡལ་བར་གཞོག་པ་ལགས།
en: How do they set aside what should be done?”

source: བཀའ་སྩལ་པ། མུན་པ་ཞེས་བྱ་བ་ནི་མི་ཤེས་པ་སྟེ།
en: The Blessed One said, “ ‘Darkness’ means ignorance.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་སེམས་ཅན་མི་ཤེས་པ་རྣམས་ཀྱི་དོན་དུ་བདེན་པ་ཐོབ་པར་བྱའོ། །
en: Bodhisattvas must attain the truth for the benefit of ignorant beings.

source: སྣང་བ་ཞེས་བྱ་བ་ནི་ཤེས་རབ་སྟེ།
en: ‘Light’ means insight.

source: ཤེས་རབ་དེས་ཀྱང་མུན་པ་བསལ་བར་བྱའོ། །
en: By that insight they must clear away darkness.

source: མི་བྱ་བ་ཞེས་བྱ་བ་ནི་མྱ་ངན་ལས་འདས་པའོ། །
en: ‘What should not be done’ means passing beyond suffering.

source: བྱ་བ་ཞེས་བྱ་བ་ནི་མངོན་པར་འདུ་བྱ་བ་མེད་པའོ། །
en: ‘What should be done’ means non-performance.

source: དེ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཡལ་བར་གཞག་པར་བྱ་སྟེ་དེ་ནི་ཚུལ་ལོ། །
en: That is what bodhisattvas must set aside. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་ཟབ་མོའི་ཆོས་ཀྱི་སྣང་བ་ལ་ཡང་གནས་པར་གྱིས་ཤིག །
en: “Therefore, noble sons, dwell in the light of the profound Dharma.

source: སྣང་བའི་ཆོས་རྣམས་ལའང་བརྙས་པར་མ་བྱེད་ཅིག །
en: Do not despise apparent phenomena.

source: སྣང་བ་དང་མི་སྣང་བ་ལའང་མ་གནས་ཤིག །
en: Do not dwell in either appearance or nonappearance.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཟབ་མོའི་ཆོས་ཀྱི་སྣང་བ་ལ་གནས་པ་ལགས།
en: The bodhisattvas asked, “Blessed One, how do bodhisattvas dwell in the light of the profound Dharma?

source: ཇི་ལྟར་ན་སྣང་བར་གྱུར་པའི་ཆོས་རྣམས་ལ་བརྙས་པ་མ་མཆིས་པ་ལགས།
en: How do they not despise apparent phenomena?

source: ཇི་ལྟར་ན་སྣང་བ་དང་མི་སྣང་བ་ལ་མི་གནས་པ་ལགས།
en: How do they not dwell in either appearance or nonappearance?

source: བཀའ་སྩལ་པ། ཟབ་ཅེས་བྱ་བ་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་སྟེ།
en: The Blessed One said, “ ‘Profound’ refers to dependent origination.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ལྟ་བ་ཐམས་ཅད་དང་བྲལ་བས་ཆོས་ཐམས་ཅད་ལ་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡིན་པར་རིག་པར་བྱའོ། །
en: By being free of all views, bodhisattvas must understand that all phenomena are dependent origination.

source: ཆོས་གང་དག་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བས་སྣང་བར་གྱུར་པ་དེ་དག་ལ་ཡང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བརྙས་པར་མི་བྱའོ། །
en: Since all phenomena are dependent origination, in order to ripen beings they must not despise apparent phenomena.

source: སྣང་བ་དང་མི་སྣང་བ་ལ་གནས་པར་མི་བྱ་བ་ནི་གཉིས་དང་བྲལ་བའི་ཕྱིར་ཏེ་དེ་ནི་ཚུལ་ལོ། །
en: They ‘do not dwell in either appearance or nonappearance’ in order to be free from duality. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་གང་ཡང་དག་པར་བསྡུ་བར་བྱ་བ་དེ་ལ་འདོད་པ་མེད་པར་གྱིས་ཤིག །
en: “Therefore, noble sons, be without desire for what is to be accumulated, and yet,

source: ཡང་དག་པར་བསྡུ་བའི་ཕྱིར་ཡང་བརྩོན་འགྲུས་མ་གློད་ཅིག །
en: in order to accumulate, do not loosen your diligence.”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་གང་ཡང་དག་པར་བསྡུ་བར་བགྱི་བ་དེ་ལ་འདོད་པ་མ་མཆིས་པ་ལགས།
en: The bodhisattvas asked, “Blessed One, how are bodhisattvas without desire for what is to be accumulated?

source: ཇི་ལྟར་ན་ཡང་དག་པར་བསྡུ་བར་བགྱི་བའི་སླད་དུ་བརྩོན་འགྲུས་ལྷོད་པར་མི་བགྱིད་པ་ལགས།
en: How do they, in order to accumulate, not loosen their diligence?”

source: བཀའ་སྩལ་པ། ཡང་དག་པར་བསྡུ་བ་ཞེས་བྱ་བ་ནི་དགེ་བའི་རྩ་བ་རྣམས་སོ། །
en: The Blessed One said, “ ‘What is to be accumulated’ are the roots of virtue.

source: དེ་ལ་འདོད་པ་མེད་པ་ནི་མི་ལྟ་བར་སེམས་ཅན་རྣམས་ལ་གཏང་བའོ། །
en: ‘Being without desire for that’ means freely giving them to sentient beings.

source: ཡང་དག་པར་བསྡུ་བ་ལ་བརྩོན་འགྲུས་མི་གློད་པ་ནི་དགེ་བའི་རྩ་བ་ལ་ངོམས་མི་ཤེས་པར་བརྩོན་པར་བྱ་བ་སྟེ་དེ་ནི་ཚུལ་ལོ། །
en: ‘In order to accumulate, not loosening their diligence’ means applying effort while never feeling sated by roots of virtue. That is the proper conduct.

source: རིགས་ཀྱི་བུ་དག་དེ་ལྟ་བས་ན་གཏིང་དཔག་དཀའ་བར་ཡང་གྱིས་ཤིག །སྤྱོད་པ་གསལ་བ་ལ་ཡང་སྣང་བར་གྱིས་ཤིག །
en: “Therefore, noble sons, on the one hand be hard to fathom, and on the other hand manifest intelligible conduct.

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་གཏིང་དཔག་དཀའ་བ་ལགས།
en: The bodhisattvas asked, “Blessed One, how are bodhisattvas hard to fathom?

source: ཇི་ལྟར་ན་སྤྱོད་པ་གསལ་བ་ལ་ཡང་གདའ་བ་ལགས།
en: How do they manifest intelligible conduct?”

source: བཀའ་སྩལ་པ། གཏིང་དཔག་དཀའ་བ་ཞེས་བྱ་བ་ནི་ཟབ་པ་ལ་སྙོམས་པར་འཇུག་པ་སྟེ། གང་ལ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་གཏིང་མི་རྙེད་པའོ། །
en: The Blessed One said, “ ‘Being hard to fathom’ means resting in the profound, a state that not even the hearers and solitary buddhas can fathom.
